Autodesk.Revit.DB.Analysis.EnergyDataSettings.SetReportsFolder(System.String)
Sets the reports folder path.
folderPath:
The string to specify the path. It may include the special label for project name.
Throws Autodesk.Revit.Exceptions.ArgumentException:
A folder path cannot contain special characters.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.Analysis.EnergyDataSettings.GetReportsFolderParsed
Gets the absolute reports folder path that is parsed from the original input.
Returns:
The reports folder path after parsing the input string.
Since:
2022

Autodesk.Revit.DB.Analysis.EnergyDataSettings.GetBuildingConstructionSetElementId(Autodesk.Revit.DB.Document)
Id of the building construction set.
Remarks:
The building construction set is the default
project construction set used when spaces are not assigned a
construction.
Returns:
Returns the id of the building construction set.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011

Autodesk.Revit.DB.Analysis.EnergyDataSettings.CheckProjectPhase(Autodesk.Revit.DB.ElementId)
Checks that the input element is a project phase.
projectPhaseId:
The element to be checked.
Returns:
True if the input element is a project phase, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011

Autodesk.Revit.DB.Analysis.EnergyDataSettings.CheckGroundPlane(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
The ground plane should be an Element of type Level.  This method checks to confirm that an ElementId is for a Level element.
ccda:
The Document.
groundPlaneId:
The element id to be checked to confirm that it is suitable to be a ground plane (i.e., that it is a level) or
that it is invalidElementId.  Setting ground plane with invalidElementId will lead to the ground plane being "reset".
Returns:
True if the input element is a level or invalidElementId, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011

Autodesk.Revit.DB.Analysis.EnergyDataSettings.CheckGroundPlane(Autodesk.Revit.DB.ElementId)
The ground plane should be an Element of type Level.  This method checks to confirm that an ElementId is for a Level element.
groundPlaneId:
The element id to be checked to confirm that it is suitable to be a ground plane (i.e., that it is a level) or
that it is invalidElementId.  Setting ground plane with invalidElementId will lead to the ground plane being "reset".
Returns:
True if the input element is a level or invalidElementId, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011

Autodesk.Revit.DB.Analysis.EnergyDataSettings.CheckConstructionSetElement(Autodesk.Revit.DB.ElementId)
Checks that the construction set ElementId is acceptable.
constructionSetElementId:
The construction set ElementId to be checked.
Returns:
True if the construction set ElementId is a valid construction set element, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011

Autodesk.Revit.DB.Analysis.EnergyDataSettings.CheckExportCategory(Autodesk.Revit.DB.ElementId)
Checks whether the export category falls within the list:
OST_RoomsOST_MEPSpaces
exportCategoryId:
The export category to be checked.
Returns:
True if the export category falls within the list, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011

Autodesk.Revit.DB.Analysis.EnergyDataSettings.IsDocumentUsingEnergyDataAnalyticalModel(Autodesk.Revit.DB.Document)
Get EnergyDataSettings element and if it exists, return result from getCreateAnalyticalModel.
ccda:
The document.
Returns:
Returns true if the Conceptual Energy Analytical Model is enabled, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011

Autodesk.Revit.DB.Analysis.EnergyDataSettings.GetFromDocument(Autodesk.Revit.DB.Document)
Every project document has a EnergyDataSettings element.
Family documents do not have EnergyDataSettings elements.
cda:
The document.
Returns:
Returns the EnergyDataSettings element or NULL.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011

Autodesk.Revit.DB.Analysis.EnergyDataSettings.ReportsFolder
The folder path where all systems analysis reports are stored. It may include special label and relative path.
Since:
2011

Autodesk.Revit.DB.Analysis.EnergyDataSettings.UseCurrentViewOnly
True if only elements visible in the currently active view are used for generation of Energy Model.
Remarks:
This setting is ignored if the currently active view is not a 3D view or AnalysisType is RoomsOrSpaces.
Since:
2024

Autodesk.Revit.DB.Analysis.EnergyDataSettings.BuildingTypeId
The building type element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2011

Autodesk.Revit.DB.Analysis.EnergyDataSettings.ProjectPhase
The project phase of the EnergyData information.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The input element is not a project phase.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2011

Autodesk.Revit.DB.Analysis.EnergyDataSettings.GroundPlane
Id of level which represents ground level.
Remarks:
The ground plane defines what is above and below ground for Conceptual Energy Analysis.
The ground plane can optionally used for the rendering cast shadows.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The input element is not a level or invalidElementId.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2011

Autodesk.Revit.DB.Analysis.EnergyDataSettings.ExportCategory
Value is a category indicating which discipline model will be used for GreenBuildingXML export.
Remarks:
OST_Rooms will use the architectural 3d rooms for export.
OST_MEPSpaces will use the MEP 3d Spaces for export.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The export category is neither OST_Rooms nor OST_MEPSpaces.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2011